// "© Copyright 2005-2007, 2015, 2017 HP Development Company, L.P."

// Window titles
CreatePaperWindowTitle = "Create New Paper Preset";
CalibratePrinterWindowTitle = "Calibrate";
CreateICCProfileWindowTitle = "Profile";
InstallICCProfileWindowTitle = "Install Profile";
CalibratePaperWindowTitle = "Calibrate Your Paper";

// Step names
CreatePaperPresetStepName = "Create Paper Preset";
AddNewPaperStepName = "Define Paper Preset";
CalibratePrinterStepName = "Calibrate";
SelectPaperStepName = "Select Paper";
FinishedStepName = "Finished";
SelectActionStepName = "Select Action";
ICCProfileSettingsStepName = "Choose ICC Profile Name";
CreateICCProfileStepName = "Profile";
InstallICCProfileStepName = "Install Profile";
SelectICCProfileStepName = "Select ICC Profile";
CheckICCProfileSettingsStepName = "Choose ICC Profile Name";

// Toc names
CreatePaperPresetTocItemName = "Create Paper Preset";
AddNewPaperTocItemName = "Define Paper Preset";
CalibratePrinterTocItemName = "Calibrate (~10 min)";
SelectPaperTocItemName = "Select Paper";
FinishedTocItemName = "Finished";
SelectActionTocItemName = "Select Action";
ICCProfileSettingsTocItemName = "Choose ICC Profile Name";
CreateProfileTocItemName = "Profile (~20 min)";
InstallICCProfileTocItemName = "Install Profile";
SelectICCProfileTocItemName = "Select ICC Profile";
CheckICCProfileSettingsTocItemName = "Choose ICC Profile Name";

// Create Paper strings
CreatePaperErrorTitle = "Cannot add new paper";
SetPropertiesErrorTitle = "Cannot set printing properties";

// Calibrate Printer strings
CalibratePrinterInfoFormat = "It is important to calibrate your printer for the new paper type before using it. Load the printer with %@ paper. Click Continue to print and scan the printer calibration chart.";
CalibratePrinterErrorTitle = "Cannot calibrate printer";

// Operation Status strings
InitiatingCalibrationTitle = "Printing calibration chart";
InitiatingProfilingTitle = "Printing ICC profiling chart";
InitiatingScanningTitle = "Preparing to scan ICC profiling chart";
CreateProfileErrorTitle = "Cannot create ICC profile";
GetOperationStatusErrorTitle = "Cannot get operation status";
CancelOperationErrorTitle = "Cannot cancel operation";
InstallProfileInfoText = "Printer calibration is in progress. When completed, the ICC profile will be installed.";
HeaderFormatString = "<html><body><font size=+7><b>User Name:&nbsp;</b>%@&nbsp;&nbsp;&nbsp;&nbsp;<b>Paper:&nbsp;</b>%@&nbsp;&nbsp;&nbsp;&nbsp;<b>Preset:&nbsp;</b>%@<BR><b>Timestamp:&nbsp;</b>%@&nbsp;&nbsp;&nbsp;&nbsp;<b>Quality:&nbsp;</b>%@&nbsp;&nbsp;&nbsp;&nbsp;<b>Gloss Opt:&nbsp;</b>%@<font></body></html>";
CalibratePrinterNoteString = "Click Cancel if you want to cancel the printer calibration.";
CreateProfileNoteString = "Click Cancel if you want to cancel the ICC profile creation.";
CalibrationCancelConfirmationTitleString = "Are you sure you want to cancel the printer calibration?";
CalibrationCancelConfirmation1MessageString = "It is strongly recommended that you calibrate your printer for each paper type before you use it. If you cancel the printer calibration, you still will be able to print with the paper, but without achieving the best color consistency.";
CalibrationCancelConfirmation2MessageString = "It is strongly recommended that you calibrate your printer for the new paper type before you use it. If you cancel the printer calibration, you still will be able to print with the new custom paper, but without achieving the best color consistency.";
AddPaperCancelConfirmationTitleString = "If you cancel adding the custom paper, you still will be able to print with the new custom paper, but without achieving the best color results. Are you sure you want to cancel adding the custom paper?";
ProfilingCancelConfirmationMessageString = "If you cancel the ICC profile creation, you still will be able to print with the paper, but without achieving the best print quality.";
ProfilingCancelConfirmationTitleString = "Are you sure you want to cancel the ICC profile creation?";

// Finish strings
CreatePaperFinishText = "You have successfully created a new paper preset. If you wish to profile and the paper supports profiling, please go to the \"Paper Preset Management\" section in Color Center and click \"Profile Paper\".";
CreatePaperWithoutProfilingFinishText = "You have successfully created a new paper preset.";
CalibrateNewPaperFinishText = "Calibration has been done successfully. If you wish to profile, and if the paper supports profiling, go to the \"Paper Preset Management\" section and click \"Profile Paper\".";
CalibratePrinterFinishText = "\n\n\n\n\n\n\n\nPrinter calibration is complete!\nClick Done to proceed.";
CreateICCProfileFinishText = "\n\n\n\n\n\n\n\nThe ICC profile was created successfully.";
CreateICCProfileFinishTextFormat = "The ICC profile was created successfully.\n\nThe ICC profile %@ for the %@ paper is available in the /Library/ColorSync/Profiles/%@ folder on your computer and can be used from your applications.\n\nIf the printed profiling chart shows banding, we recommend that you perform a 'Paper Advance Calibration' from the printer's front panel menu in the 'Image Quality Maintenance' section. Once this is done, perform the Create and Install ICC Profile workflow again.";
CreateICCProfilePrintOnlyFinishText = "You can safely unload the printed profiling chart. It is important that the chart is dry before scanning.\n\nWhen you decide to create an ICC profile select the option, \"Scan ICC profiling chart and create ICC profile\".\n\nIf the printed profiling chart shows banding, we recommend that you perform a 'Paper Advance Calibration' from the printer's front panel menu in the 'Image Quality Maintenance' section. Once this is done, perform the Create and Install ICC Profile workflow again.";
CreatePrintedICCProfileFinishText = "The ICC profile was created successfully.\n\nThe ICC profile %@ for the %@ paper is available in the /Library/ColorSync/Profiles/%@ folder on your computer and can be used from your applications.";
InstallICCProfileFinishTextFormat = "The ICC profile was installed successfully.\n\nThe ICC profile %@ for the %@ paper is available in the /Library/ColorSync/Profiles/%@ folder on your computer and can be used from your applications.";
InstallICCProfileFinishText = "\n\n\n\n\n\n\n\nThe ICC profile was installed successfully.";
CalibrateWithoutProfilingFinishText = "Calibration has been done successfully.";
"InstallICCProfileFinishAuthFailedTextFormat" = "The ICC profile was installed successfully to %@.";
"InstallICCProfileFinishAuthFailedTextWarn" = "Unable to update the paper list on your computer because authentication has failed.";
"InstallICCProfileFinishAuthFailedTextWarnDescription" = "ICC profile %@ for the %@ paper cannot be used from your applications until you update the paper list on your computer. To perform this please click refresh button on \"Paper Preset Management\" screen in HP Printer Utility.";
"CreatePaperFinishAuthFailedTextWarnDescription" = "%@ paper cannot be used from your applications until you update the paper list on your computer. To do this, click the Refresh button on the \"Paper Preset Management\" screen in the HP Printer Utility.";
// Select Paper strings
GetPaperListErrorTitle = "Cannot get paper list";

// Profile Settings strings
ProfileSettingsTitle1 = "The ICC profile will be created and installed using the following settings:";
ProfileSettingsTitle2 = "Please provide the ICC profile settings that you can find below the printed profiling chart you want to scan.";
InstallProfileSettingsTitle = "The ICC profile %@ will be installed using the following settings:";
ProfileSettingsNote1 = "Load the printer with %@ paper (size A3/B). Click Continue to print and scan the ICC profiling chart and to create the ICC profile.";
ProfileSettingsNote2 = "Load the printer with %@ paper (size A3/B). Click Continue to print and scan the ICC profiling chart and to create the ICC profile.";
ProfileSettingsNote3 = "Load the printer with the ICC profiling chart printed on %@ paper (size A3/B). Click Continue to scan the ICC profiling chart and create the ICC profile.";
InstallProfileSettingsNote1 = "It is important to calibrate your printer for the new paper type before using it. Load the printer with %@ paper. Click Continue to print and scan the printer calibration chart.";
InstallProfileSettingsNote2 = "Click Continue to install the ICC profile.";
ResetSettingTitle = "Selected setting differs from the one within the ICC profile.";
ResetSettingMessage = "Are you sure that you want to change the default setting?";

// Install Profile strings
InstallProfileCancelConfirmationTitleString = "If you cancel the ICC profile installation, you still will be able to print with your paper, but without achieving the best print quality. Are you sure you want to cancel the ICC profile installation?";
InstallProfileTitleFormat = "The ICC profile %@ will be copied into the /Library/ColorSync/Profiles/%@ folder and registered with ColorSync.\n\nIt will be installed on the printer where it can be accessed by other users.";
SetProfileErrorTitle = "Cannot install ICC profile";
GetProfileErrorTitle = "Cannot get ICC profile";

// Select Profile strings
ProfileErrorTitle = "Cannot install selected ICC profile";
UnableToOpenErrorMessageFormat = "Unable to open %@";
ProfileIsNotOutputErrorMessage = "Profile is not an output profile.";
ProfileIsNotRGBErrorMessage = "Profile is not RGB.";
ProfileInvalidColorSpaceErrorMessageFormat = "Profile is not %@.";
TagsMissingErrorMessage = "Some required tags are missing.";
ProfileIsNotValidErrorMessage = "Profile is not valid.";
ProfileIsNotValidErrorMessageFormat = "Profile is not valid. Not output, not %@, missing tags.";
ManufacturerIsNotHPErrorMessage = "Manufacturer is not HP.";
NotPrintProfilerErrorMessage = "Profiler is not PrintProfiler.";
NotHPICCErrorMessage = "Incorrect manufacturer, device, CMM.";
RGB = "RGB";
CMYK = "CMYK";

// Select and Calibrate Paper strings
LoadPaperFormatString = "Load the printer with %@ paper (size %@ minimum). Click Continue to print and scan the printer calibration chart.";

// Calibration status
CalibrationStatusRecommended = "Recommended";
CalibrationStatusOK = "OK";
CalibrationStatusOutOfDate = "Obsolete";

// Synchronization strings
DownloadProfilesTitleString = "Downloading ICC profiles...";
SynchronizeProfilesTitleString = "Updating ICC profiles...";
DownloadProfilesTitleFormatString = "Downloading ICC profiles for %@ paper:\n%u of %u";

SyncronizationSuccessfullTitleString = "The paper list was updated successfully";
SyncronizationSuccessfullMessageString = "You can print with the new custom papers from now on.";
MediaManagementErrorTitleString = "Cannot get information about custom papers from printer";
SyncronizationIncompleteTitleString = "Cannot update whole paper list";
SyncronizationIncompleteMessageFormatString = "The following papers have not been updated:\n%@";
RegistrationIncompleteTitle = "Cannot update the paper";
RegistrationIncompleteMessage = "The following papers have not been registered:\n%@";

// Operation status
CALIBRATION-STARTING = "Printing calibration chart";
CALIBRATION-PREPARING-TO-PRINT = "Printing calibration chart";
CALIBRATION-PREPARING-TO-SCAN = "Preparing to scan calibration chart";
CALIBRATION-PRINTING = "Printing calibration chart";
CALIBRATION-DRYING = "Drying calibration chart";
CALIBRATION-SCANNING = "Scanning calibration chart";
CALIBRATION-CALCULATING = "Calculating calibration results";
CALIBRATION-FINISHING = "Calculating calibration results";
CALIBRATION-CANCELLING = "Canceling printer calibration";
PROFILING-STARTING = "Printing ICC profiling chart";
PROFILING-PREPARING-TO-PRINT = "Printing ICC profiling chart";
PROFILING-PREPARING-TO-SCAN = "Preparing to scan ICC profiling chart";
PROFILING-PRINTING = "Printing ICC profiling chart";
PROFILING-DRYING = "Drying ICC profiling chart";
PROFILING-SCANNING = "Scanning ICC profiling chart";
PROFILING-CALCULATING = "Creating ICC profile";
PROFILING-FINISHING = "Creating ICC profile";
PROFILING-CANCELLING = "Canceling ICC profile creation";

GetMediumListTitleString = "Retrieving paper list...";
AddNewPaperTitleString = "Creating Paper Preset...";
CalibratePrinterTitleString = "Calibrating printer...";
CreateProfileTitleString = "Creating ICC profile...";
CancelingProfilingTitleString = "Canceling ICC profile creation...";
CancelingCalibrationTitleString = "Canceling printer calibration...";

CancelingProfileInstallationTitleString = "Canceling ICC profile installation";
InstallingProfileTitleString = "Installing ICC Profile";

ProfilingProcessFailedErrorMessage = "The ICC profiling has failed.";
CalibrationProcessFailedErrorMessage = "The printer calibration has failed.";

SynchronizeTitleString = "Updating paper list...";

ICCProfileTitleString = "ICC Profile";
CalibrationStatusTitleString = "Calibration Status";

LoadedPaperTypeMismatchMessage = "The Paper Preset name has to match the paper selection in the printer's front panel. Click OK to change the name of the loaded paper in the front panel automatically.";
LoadedPaperTypeMismatchProfilingNotAllowedMessage = "The Paper Preset name has to match the paper selection in the printer's front panel. Click OK to change the name of the loaded paper in the front panel automatically.";
LoadedPaperTypeMismatchMessageFormat = "You have selected \"%@\", but the printer is loaded with \"%@\". Click 'OK' to change the Loaded Paper Type in your printer automatically and use \"%@\" from now on. Or go to the printer and replace the loaded media with the \"%@\" (size A4/A for calibration, A3/B for profiling) and click 'OK'.";
LoadedPaperTypeMismatchProfilingNotAllowedMessageFormat = "You have selected \"%@\", but the printer is loaded with \"%@\". Click 'OK' to change the Loaded Paper Type in your printer automatically and use \"%@\" from now on. Or go to the printer and replace the loaded media with the \"%@\" (size A3/B for calibration) and click 'OK'.";

// Gloss Enhancer
OFF = "Off";
FULLPAGE = "On";
INKEDAREA = "On";

// Paper category
BOND_AND_COATED = "Bond and Coated Paper";
PHOTO = "Photo Paper";
PROOFING = "Proofing Paper";
FINE_ART = "Fine Art Material";
FILM = "Film";
TECHNICAL = "Technical Paper";
CUSTOM = "Custom Paper";
BACKLIT = "Backlit Material";
ADHESIVE = "Adhesive Paper";
BANNER_AND_SIGN = "Banner and Sign Material";
HP_EXTENDED_MEDIA = "Additional Papers";

CalibrationStatusNotApplicable = "Not applicable";

"No response" = "Please check that your printer is connected and turned on, then try again.";
UNDEFINED-ERROR = "An error has occurred.";
ERROR-IN-PARAMS = "An error has occurred.";
UNKNOWN-OPERATION = "The operation has timed out.";
PRINTER-BUSY = "The printer is busy. Wait until the printer has finished any current printjob.";
UNDEFINED-MEDIUM = "The selected paper does not exist anymore. It might have been deleted by another user.";
MEDIUM-MISMATCH = "Different paper type loaded.";
MEDIUM-MISMATCH-NEW-PAPER-CALIBRATION-FORMAT = "Different paper type loaded. You have selected %@, but the printer is loaded with a different paper type. If you are certain that the loaded paper is of the same type as the one you have just selected, go to the printer front panel and select 'Change paper type' in the 'Paper' menu. Otherwise unload the current paper, load the printer with %@ (size %@ minimum) and click 'Continue' to print and scan the printer calibration chart. Click 'Cancel' to calibrate the printer later.";
MEDIUM-MISMATCH-CALIBRATION-FORMAT = "Different paper type loaded. You have selected %@, but the printer is loaded with a different paper type. Unload the current paper, load the printer with %@ (size %@ minimum) and click 'Continue' to print and scan the printer calibration chart. Click 'Cancel' to calibrate the printer later.";
MEDIUM-MISMATCH-PROFILING-FORMAT = "Different paper type loaded. You have selected %@, but the printer is loaded with a different paper type. Unload the current paper, load the printer with %@ paper (size A3/B minimum) and click 'Continue' to print and scan the ICC profiling chart and to create the profile. Click 'Cancel' to create the profile later.";
BADSIZE-MEDIUM = "Loaded paper is too small.";
BADSIZE-MEDIUM-CALIBRATION-FORMAT = "Loaded paper is too small. Unload the current paper, load the printer with %@ (size %@ minimum) and click 'Continue' to print and scan the printer calibration chart. Click 'Cancel' to calibrate the printer later.";
BADSIZE-MEDIUM-PROFILING-FORMAT = "Loaded paper is too small. Unload the current paper, load the printer with %@ paper (size A3/B minimum) and click 'Continue' to print and scan the ICC profiling chart and to create the profile. Click 'Cancel' to create the profile later.";
NO-MEDIUM-LOADED = "No paper loaded.";
NO-MEDIUM-LOADED-GENERAL-CALIBRATION-FORMAT = "No paper loaded. Load the printer with %@. Click 'Continue' to print and scan the printer calibration chart. Click 'Cancel' to calibrate the printer later.";
NO-MEDIUM-LOADED-CALIBRATION-FORMAT = "No paper loaded. Load the printer with %@ paper (size %@ minimum). Click 'Continue' to print and scan the printer calibration chart. Click 'Cancel' to calibrate the printer later.";
NO-MEDIUM-LOADED-GENERAL-PROFILING-FORMAT = "No paper loaded. Load the printer with %@ paper. Click 'Continue' to print and scan the ICC profiling chart and to create the profile. Click 'Cancel' to create the profile later.";
NO-MEDIUM-LOADED-PROFILING-FORMAT = "No paper loaded. Load the printer with %@ paper (size A3/B). Click 'Continue' to print and scan the ICC profiling chart and to create the profile. Click 'Cancel' to create the profile later.";
INVALID-MEDIUM-PROFILING-FORMAT = "Load the printer with the ICC profiling chart printed on %@ paper (size A3/B). Click Continue to scan the ICC profiling chart and create the ICC profile.";
NO-MEDIUM-LOADED-SCAN-PROFILE-FORMAT = "Load the printer with the ICC profiling chart printed on %@ paper (size A3/B). Click Continue to scan the ICC profiling chart and create the ICC profile.";
INVALID-MEDIUM = "An error has occurred.";
PROFILE-DOESNT-EXIST = "An error has occurred.";
MEDIUM-CANNOT-BE-DELETED = "Factory HP papers cannot be deleted.";
MEDIUM-DOESNT-EXIST = "The selected paper does not exist anymore. It might have been deleted by another user.";
MEDIUM-ALREADY-EXISTS = "A paper with the same name already exists. Enter a different paper name and try again.";
MEDIUM-ALREADY-EXISTS-FORMAT = "A paper with the name %@ already exists. Enter a different paper name and try again.";
NO-ROOM-FOR-MORE-MEDIA = "No more custom papers can be added. Delete any existing custom papers before adding new ones.";
MEDIUM-NOT-CLONABLE = "An error has occurred.";
PROFILE-CANNOT-BE-DELETED = "An error has occurred.";
MISSING-MEDIUM-NAME = "No paper name has been entered. Enter a paper name and try again.";

InstallProfileTitle = "The ICC profile will be installed on the printer where it can be accessed by other users.";

"Paper Name: " = "Paper Name: ";
"ICC Profile Name: " = "ICC Profile Name: ";
"Printer Model: " = "Printer Model: ";
"Username: " = "Username: ";
"Timestamp: " = "Timestamp: ";
"Gloss Enhancer: " = "Gloss Enhancer: ";
"Paper Type: " = "Paper Type: ";

EmptyItem = "None";
ResponseErrorMessage = "Please check that your printer is connected and turned on, then try again.";

// Button titles
TryAgainButtonTitle = "Try again";
CreateButtonTitle = "Create";
CalibrateButtonTitle = "Calibrate";

"GlossEnhancer" = "Gloss Enhancer";
"AdvancedRecommendationText" = "Paper Advance Calibration";
"AdvancedCalibrationInfoText" = "Easy and automatic creation of ICC profiles";
"SharePresetsInfoText" = "Share your paper presets";
"PrintProfilingChartTitle" = "Print Profiling Chart";
"PreparingCalibrationScanTitle" = "Preparing to scan calibration chart";
"PreparingProfilingScanTitle" = "Preparing to scan ICC profiling chart";
"CreatePresetMenu" = "Create New Paper Preset";
"ImportPresetMenu" = "Import Paper Preset";
"ManagePresetMenu" = "Paper Preset Management";
"LoadedPaperTypeMismatchManualChangeMessage" = "The Paper Preset name has to match the paper loaded into the printer. Please go to the printer and load \"%@\".";

//xib localization
HSDSelectProfileTitle = "Select the ICC profile you want to install:";
ChooseButtonTitle = "Choose...";

SelectProfileActionTitle = "Select action:";
PrintICCProfilingChartTitle = "Print ICC profiling chart";
ScanICCProfilingChartTitle = "Scan ICC profiling chart and create ICC profile";
TotalTitle = "Total";

CreatePaperDesciption = "Please provide the name and the type of the paper and click next to continue. This paper will be available in the printer's front panel under Custom Papers.\n\nPaper type selection is fundamental for good results. For tips & tricks on how to select paper type, click the question mark icon.";
ChangePrintingPropertiesTitle = "Change Printing Properties";
